[{"key":"TSSD-4491","summary":"Transaction Status Mismatch – Mudad Integration","description":"Hello Team,\n\nOur client has processed a salary transaction through the Mudad integration. The client confirmed that the salary was successfully transferred to the employee; however, on Bayzat the transaction status is still showing as Rejected.\n\nCould you please investigate this? The concern is that if the client closes the month while the status remains rejected, the amount might be carried over to the next month incorrectly.\n\nTransaction ID: \n9bb6042b-ce08-417d-9cb8-7e2c1a24c64b","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Ali Ismael","status":"In Progress","issuetype":"Bug","companyName":"Assas IT Solutions","comments_summary":"Issue with Mudad payment submission. Internal server error received. Engy investigated and found transaction was created on 31/8 with submission date 2/9, indicating no delay. Payment status showed as accepted but pending debit. Client advised to follow up in a day or two if payment not received."},{"key":"TSSD-4482","summary":"Couldn't Cancel processing via Mudad","description":"the due date was 30 of August and the employee didn't receive any payment yet so the client want to cancel to transfer them the salaries direct however she is afraid of any duplication I was trying to cancel but couldn't The payment cannot be cancelled on or after the value date.","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nada Mohamed Sherif Mohamed Ragaey Kirah","status":"In Progress","issuetype":"Bug","companyName":"Oasis Women's Resource Center","comments_summary":"Client unable to cancel Mudad transaction. Engy explained cancellation not possible as transaction already started. Transaction created 31/8, submission date 2/9, status accepted pending debit. Advised client to follow up if payment not received in 1-2 days."},{"key":"TSSD-4453","summary":"Payroll Iban error","description":"Admin receiving the attached error.","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Manisha Chincholia","status":"Done","issuetype":"Bug","companyName":"Aqua Reach General Trading L.L.C","comments_summary":"Issue with employee payment. Engy investigated and found problem related to account mapping. Xero rejected push to Wages Payable account. Client advised to map different chart of account. Sneha assisted in correcting routing code, resolving the issue."},{"key":"TSSD-4421","summary":"Acc. integration failed","description":"Acc. integration sync failed with the following error message:\n'A validation exception occurred: Account code 'CL-2003' is not a valid code for this document.'","project":"Technical Support Service Desk","assignee":"Ahraz Akhtar","reporter":"Daria Maksimova","status":"Done","issuetype":"Bug","companyName":"RTA CAREEM L.L.C","comments_summary":"Client experiencing issues with Xero integration. Ahraz identified problem: client mapped same account for bank account and salary pay item. Xero rejecting push to Wages Payable account. Client advised to map different chart of account to resolve issue."},{"key":"TSSD-4393","summary":"Something went error While Transaction through SAB Bank","description":"The client is trying to process a transaction through SAB integration and he gets an error of something went wrong, can you please check.","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Ali Ismael","status":"In Progress","issuetype":"Bug","companyName":"Rohamaa International Trading Limited Company","comments_summary":"SAB integration issue reported. Engy escalated to development team. Ahraz shared new digital certificate with SAB for update. Awaiting confirmation of update from SAB. Issue pending resolution."},{"key":"TSSD-4306","summary":"OTP Not Received During Mudad Integration","description":"We are currently in the process of integrating Mudad with Bayzat for the company registered under:\n\nCR Number: 1010846735\n\nOrganization ID: 01-208403\n\nSignatory ID: 1087477897\n\nHowever, we are facing an issue where the OTP message is not being received during the integration process.\n\nCould you please assist us in resolving this? Or would you recommend that we escalate this by sending an email directly to Mudad?\n\nThank you for your support.\n\nBest regards,","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Ali Ismael","status":"Done","issuetype":"Bug","companyName":"Assas IT Solutions","comments_summary":"Issue with Mudad integration reported. Engy confirmed similar issue escalated to Mudad. Client info shared with Mudad. Engy checked logs, found error from Mudad side. Requested client to start fresh trial after Mudad's feedback that issue should be resolved. Awaiting confirmation of resolution."},{"key":"TSSD-4282","summary":"An error occured, please contact administrator-During Mudad integration","description":"An error occured, please contact administrator.\nin the otp stage \nand the client want to transfer the salary today","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nada Mohamed Sherif Mohamed Ragaey Kirah","status":"Done","issuetype":"Bug","companyName":"Middle Nile General Contracting Company","comments_summary":"Client facing Mudad integration issue. Engy found error in ACTIVATE_SIGNATORY step, suggesting problem with legal identification number. Authorized person's details provided. Engy added info to Mudad email. Mudad feedback indicated issue should be resolved. Client asked to retry integration. Awaiting confirmation of resolution."},{"key":"TSSD-4251","summary":"the client couldn't receive the OTP code","description":"the client couldn't receive the OTP code","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nada Mohamed Sherif Mohamed Ragaey Kirah","status":"Done","issuetype":"Bug","companyName":"Picker","comments_summary":"Client encountered Mudad integration error. Engy identified possible issue with legal identification number. Authorized person's details provided and added to Mudad email. Mudad feedback suggested issue resolution. Client asked to retry integration. Awaiting confirmation of successful integration."},{"key":"TSSD-4235","summary":"Client cann't connect with mudad","description":"when client tried connecting their account with mudad they don't received the verification code for the authorized person on mudad\n\nemployee who tried to integrate mudad is (Abdulrahman Alfi) email id (aalfi@sifi.sa)\n\nwe need to have the logs to see he response from mudad so we can define where is the issue exactly, if it's from mudad side so we can contact them ASAP\n\nplease note that this client is already stated we are not allowed to impersonate any user, or log into their account form our side if anything needs to be done on the platform please let me know so we can arrange  a meeting with him.","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"MOHAMED EKSHAIKH","status":"Done","issuetype":"Bug","companyName":"Simplified Financial Solutions Company","comments_summary":"Client faced Mudad integration problem. Engy found error in ACTIVATE_SIGNATORY step, indicating possible legal identification number issue. Client confirmed ID correctness. Engy sent email to Mudad. Mudad feedback suggested issue resolution. Client asked to retry integration. Awaiting confirmation of successful integration."},{"key":"TSSD-4114","summary":"Couldn't integrate with Mudad","description":"Couldn't integrate with Mudad (I've tried the two formula of MOI number) \n\nMOL number: 01-5969402, I raised a previous The commercial registration is expired no I have the updated one is attached.","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nada Mohamed Sherif Mohamed Ragaey Kirah","status":"Done","issuetype":"Bug","companyName":"Advanced Business Company for Customs Clearance","comments_summary":"Client had Mudad integration issues. Engy identified two problems: expired commercial registration number and incorrect MOL number. Engy created new document with updated expiry date and provided correct MOL number. After fixes, integration proceeded to next step. Client asked to complete remaining steps and report results."},{"key":"TSSD-4075","summary":"Accounting Integrations - Paid via error message","description":"The client has been trying to sync their payroll with accounting integration and in doing so has been facing an issue as the records arent capturing. I seek urgent assistance here.","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nathan Philip Saldanha","status":"Done","issuetype":"Bug","companyName":"Sancta Capital Advisors Limited","comments_summary":"Request received for Nathan. Engy requested Ahraz to check the issue. Ahraz asked Nathan to have the client map details on the credit page. Engy followed up for an update. Issue pending client action on mapping details."},{"key":"TSSD-4047","summary":"Couldn't integrate with Mudad","description":"Couldn't integrate with Mudad (I've tried the two formula of MOI number) \n\nMOL number: 01-5969402","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nada Mohamed Sherif Mohamed Ragaey Kirah","status":"Done","issuetype":"Bug","companyName":"Advanced Business Company for Customs Clearance","comments_summary":"Client experiencing issues with OTP reception during Mudad integration. Engy suggested starting integration from scratch and requested updated company information. Sara reported client changed mobile number. Engy offered to contact Mudad for number update. Awaiting client confirmation on next steps."},{"key":"TSSD-4017","summary":"Xero will discontinue their Global Pay Run starting July","description":"The client received a notification from Xero that they will discontinue their Global Pay Run starting July.Does this mean that Bayzat can no longer interface payroll to Xero from that point, as Xero will no longer have a payroll module? I have attached the email.","project":"Technical Support Service Desk","assignee":"Ahraz Akhtar","reporter":"Nathan Philip Saldanha","status":"Done","issuetype":"Support","companyName":"JW International Advertising LLC","comments_summary":"Issue with Xero connection due to uncertified apps limit. Ahraz explained uncertified apps concept. Nathan requested clarification on connected apps. Ticket kept open for further investigation. Pending identification of uncertified connections."},{"key":"TSSD-3981","summary":"Accounting Integrations Questions and Issues","description":"The client uses Xero and would like to integrate with Bayzat. However they have the following concerns\n- The client has multiple entities however when establishing connection can only select 1 organization\n- When trying to select an organization they get an error Uncertified app connection limit reached\n- They would like to have a step by step document, training if we have something at our end.","project":"Technical Support Service Desk","assignee":"Ahraz Akhtar","reporter":"Nathan Philip Saldanha","status":"In Progress","issuetype":"Support","companyName":"Quiqup Delivery LLC","comments_summary":"Client unable to connect Xero due to uncertified apps limit. Ahraz explained the concept and provided examples. Nathan requested to keep the ticket open. Client shared additional connections, awaiting identification of uncertified ones. Issue unresolved, pending further investigation."},{"key":"TSSD-3952","summary":"Couldn't integrate with Mudad","description":"They are trying to connect Mudad, but they didn't receive the OTP message. There is an error message on the platform stating that the account is not active.","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Sara Ali Abdelaziz","status":"Done","issuetype":"Bug","companyName":"Sky Foundation Day Care","comments_summary":"Client facing OTP issues with Mudad integration. Engy suggested restarting integration, requested company details. Sara reported client's mobile number change. Engy contacted Mudad. Mudad indicated the new number not updated in bank. Client advised to update information with bank before retrying. Pending client action."},{"key":"TSSD-3926","summary":"One of th employee didn't receive her salary yet","description":"the client has transferred the salary Via Mudad and all the employees has been received their salary except this employee, she didn't receive  her salary till now","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nada Mohamed Sherif Mohamed Ragaey Kirah","status":"Done","issuetype":"Bug","companyName":"Oasis Women's Resource Center","comments_summary":"Issue reported with salary transfer. Engy Attia confirmed the transfer was completed according to Mudad's response. Client asked to check with their bank as other employees received salaries normally. Nada Mohamed verified the IBAN was correct. Awaiting further updates from Mudad or the client's bank."},{"key":"TSSD-3807","summary":"Client can't integrate mudad account with bayzat","description":"client can't connect mudad to his bayzat account","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"MOHAMED EKSHAIKH","status":"In Progress","issuetype":"Bug","companyName":"Al Maskan Al Wafi Real Estate Development Company","comments_summary":"Client reported an issue. Engy Attia requested screenshots and steps to reproduce. Mohamed Ekshaikh provided screenshots of CR, MOL ID numbers, owner ID, IBAN, and error message. Engy confirmed it's a known Mudad issue affecting multiple companies. Team is working on an alternative solution. Safwan Youseph requested a list of affected companies for follow-up."},{"key":"TSSD-3804","summary":"Account Integration","description":"Hi team,\n\nThis is an urgent request. The client integrated their Bayzat account with Xero accounting software successfully; however, they are experiencing an issue with VAT. When the expenses were pulled, the VAT amounts were not included.\n\nCould you please advise on the steps they need to take to resolve this issue? \n\nLet me know if you need any further information from the client.\n\nThank you,","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Aya nabil","status":"Done","issuetype":"Bug","companyName":"Food People Consultancy","comments_summary":"Client reported an issue. Engy Attia requested screenshots and steps to reproduce. Aya Nabil awaited client feedback. After no updates, Engy followed up. Aya suggested closing the case due to lack of client response."},{"key":"TSSD-3731","summary":"Coudln't procces through mudad","description":"Got an error message signatory is inactive while trying to process salaries with Mudad","project":"Technical Support Service Desk","assignee":"Ashaff Hussain","reporter":"Sara Ali Abdelaziz","status":"In Progress","issuetype":"Bug","companyName":"Mona Hamed Muthib Al-Sulami and its partners company For Law and Legal Consultations","comments_summary":"Client reported an issue with Mudad. Engy Attia confirmed it's a known problem affecting multiple companies. Team is working on an alternative solution. Ashaff Hussain provided a potential fix from Mudad: delete establishment, add new one, add signatory, and authorize signatory. Awaiting results of this solution."},{"key":"TSSD-3701","summary":"Accounting Integration Challenges","description":"The client uses Xero as their accounting platform and have the below queries \n1) Multiple Account Mappings - For multiple departments, we need different Xero accounts to be integrated for each department. At the moment, Bayzat does not have that capability. Bayzat only integrates a cost to 1 Xero account, regardless of Department. The reason we have several Departments is because the cost will be accounted for in different sets of accounts in Xero for effective tracking. So this affects the following entries:\nMonth-End Payroll\nMonthly Gratuity Accrual\n\n2) Leaves Accrual - while payroll reports include Leaves Salary Accrual Report Bayzat does not actually integrate a monthly leaves accrual entry to Xero. Appreciate it if you could please explore this possible Bayzat improvement.\n\n3) Air Ticket Accrual - while payroll reports include Air Ticket Allowance Accrual Report, Bayzat also does not integrate a monthly air ticket allowance accrual to Xero for the portion earned. Also, please explore this possible Bayzat improvement.","project":"Technical Support Service Desk","assignee":"Ashaff Hussain","reporter":"Nathan Philip Saldanha","status":"In Progress","issuetype":"Bug","companyName":"JW International Advertising LLC","comments_summary":"Client requested updates on three issues. Ashaff Hussain responded that issue #1 is in the design phase, while issues #2 and #3 are not currently prioritized. No further action required at this time."},{"key":"TSSD-3662","summary":"Integration with Xero System","description":"Hey team, a potential new client is inquiring about integrating with the Xero system. They will be using three separate books of accounts within Xero, each assigned to different employees. Is it possible to sync data from one payroll system to these three different accounting books?","project":"Technical Support Service Desk","assignee":"Ashaff Hussain","reporter":"Haytham Ghali","status":"Done","issuetype":"Support","companyName":null,"comments_summary":"Client requested export of file. Ashaff confirmed this feature is not currently available but may be in coming months. Haytham scheduled a call to understand requirements. Meeting set for following day at 3 PM. Issue remains unresolved pending further discussion and potential feature development."},{"key":"TSSD-3628","summary":"Error while Processing Salaries with Mudad","description":"The client is getting this error while Integration in  Activate Bank account step >> \"Authorized Signatory is not active\"","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Ali Ismael","status":"In Progress","issuetype":"Bug","companyName":"Al Maskan Al Wafi Real Estate Development Company","comments_summary":"Issue identified with bank account activation during Mudad integration. Error message indicates bank account type not accepted. Engy suggested client check with bank. Ali confirmed integration phase issue. Team awaiting Mudad's response to resolve the problem."},{"key":"TSSD-3627","summary":"Error while Processing Salary with Mudad","description":"The client got this error while trying to process salary through Mudad \"Signatory is not active\" can you please check.","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Ali Ismael","status":"Done","issuetype":"Bug","companyName":"Rohamaa International Trading Limited Company","comments_summary":"Multiple companies facing same issue with inactive signatory error from Mudad. Safwan following up with Mudad for resolution. Team awaiting response from Mudad to address the recurring problem affecting multiple clients."},{"key":"TSSD-3613","summary":"The signatory is inactive-Process with Mudad","description":"The signatory is inactive.\n\nthis is the second client for me has the same issue","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nada Mohamed Sherif Mohamed Ragaey Kirah","status":"Done","issuetype":"Bug","companyName":"Oasis Women's Resource Center","comments_summary":"Company facing 'signatory inactive' error when processing payroll. Engy confirmed it's a Mudad issue affecting multiple companies. Team sent email to Mudad and awaiting response. Issue unresolved, impacting client's ability to process payroll for third consecutive month."},{"key":"TSSD-3604","summary":"Couldn't integrate with Mudad","description":"a pop wrong message when the client try to integrate their National Commercial Bank bank with Mudad\nAuthorizer ID is expired. Please update the authorizer ID and update the information at the bank","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nada Mohamed Sherif Mohamed Ragaey Kirah","status":"In Progress","issuetype":"Bug","companyName":"Middle Nile General Contracting Company","comments_summary":"Client experiencing bank account type acceptance issue with Mudad integration. Engy suggested checking with bank. Nada confirmed bank (SNB) is supported by Mudad. Team sent email to Mudad for clarification. Issue unresolved for three months, escalated to management. Awaiting Mudad's response."},{"key":"TSSD-3558","summary":"Netsuite integration issue","description":"The client tried connecting with Netsuite but is getting the message that 'Accounting integration is in progress' since last week. Can you please assist in resolving this issue?","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Yohann Allen","status":"Done","issuetype":"Bug","companyName":"Sign Works FZ LLC","comments_summary":"Issue with Netsuite integration. Client unable to pull tracking categories. Codat team confirmed client needs additional permissions: Setup - Custom Record Types, Setup - Custom Segments, Lists - Classes, Lists - Departments. Client granted permissions but issue persisted. Codat requested screenshots of Custom Record permissions, specifically for CSEG_PAACTIVITYCODE. Additional permissions for List - Cost Centers and List - Business Units needed. Awaiting client's response on updated permissions."},{"key":"TSSD-3530","summary":"the client didn't receive the PMS number","description":"while the Mudad integration the client didn't receive the PMS number, what I need is to confirm with me the number that he should receive the OTP on it.\nHere is the number: +966541022000\n\nPN: I raised this issue before with no solution","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nada Mohamed Sherif Mohamed Ragaey Kirah","status":"In Progress","issuetype":"Bug","companyName":"Safqah Financial a one-person company","comments_summary":"Client experiencing issues with Mudad integration. Error receiving OTP for 5 months. Mudad team unresponsive to multiple inquiries. Bayzat team confirmed no issues on their end. Suggested checking with bank and comparing phone numbers. Mudad representative mentioned possible app blocking OTP receipt. Client requested full refund due to ongoing issues. Awaiting resolution from Mudad or further troubleshooting steps."},{"key":"TSSD-3311","summary":"Coudln't transfer the salaries via Mudad","description":"the client trying to transfer the salary using Mudad but there is an error message \" The signatory is inactive\"","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nada Mohamed Sherif Mohamed Ragaey Kirah","status":"Done","issuetype":"Bug","companyName":"Jana and Azam Trading Establishment","comments_summary":"Multiple clients facing issues with Mudad integration during payroll processing. Mudad team unresponsive to inquiries. Bayzat team confirmed no issues on their end, suggesting problem lies with Mudad or client side. Provided transaction details to Mudad for investigation. Issue affecting multiple clients, causing concern. Awaiting response from Mudad for resolution. Client satisfaction at risk due to prolonged issue."},{"key":"TSSD-3302","summary":"\"The signatory is inactive\" Error While Processing through Mudad","description":"The client is encountering the error \"The signatory is inactive\" when attempting to submit a transaction through Mudad. This client has experienced numerous issues with Mudad in the past, so please prioritize this ticket. They are on the verge of losing trust in both the integration and Bayzat.","project":"Technical Support Service Desk","assignee":"Ashaff Hussain","reporter":"Ali Ismael","status":"In Progress","issuetype":"Bug","companyName":"Majal Al-Prevention Contracting Company for Radiation Health Consultations, a one-person company","comments_summary":"Client facing error with Mudad integration: 'The related signatory is inactive'. Bayzat team investigated and confirmed error coming directly from Mudad. Email sent to Mudad team for resolution. Awaiting response from Mudad to address the inactive signatory issue. No further updates provided in the ticket."},{"key":"TSSD-3216","summary":"Accounting integration - Microsoft BC sync to batch faild","description":"The customer has created a batch name \"Payroll\" and enabled Bayzat to write to it but still we encounter this issue.\n\ncan you please look into logs or provide more insight about this","project":"Technical Support Service Desk","assignee":"Ashaff Hussain","reporter":"Khalid Ibrahim","status":"Done","issuetype":"Support","companyName":"Al-Bawani Company for Business Services","comments_summary":"Issue with Microsoft Dynamics 365 Business Central integration. Client unable to push journal entries. Ashaff suggested testing without selecting an employee and adding no dimensions. If this fails, it indicates a mandatory enablement for dimensions in MSBC 365 setup that needs to be switched off for Bayzat integration. Ticket resolved and closed after client confirmation."},{"key":"TSSD-3194","summary":"Accounting Integration - Microsoft BC (GOSI for Employer field)","description":"the customer is looking to have the total GOSI amount posted to accounting system MS BC. currently there is only one value for GOSI and this represent the Employee contribution. we need to have the employer contribution for the finance to be able to close the GOSI account invoice on their system.","project":"Technical Support Service Desk","assignee":"Ashaff Hussain","reporter":"Khalid Ibrahim","status":"Done","issuetype":"New Feature","companyName":"Al-Bawani Company for Business Services","comments_summary":"Issue regarding employer GOSI contribution in accounting integration. Ashaff explained that employer contribution is not included on the platform and must be manually added by the customer. Khalid confirmed cost centers are needed, which current MS Dynamics integration doesn't support. Decided to proceed without integration due to cost center requirement."},{"key":"TSSD-3188","summary":"Can't sync the  records to Microsoft dynamics 365","description":"Can't sync the  records to Microsoft dynamics 365 got the multiple errors (will attach report)","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"MOHAMED EKSHAIKH","status":"Done","issuetype":"Bug","companyName":"Al idara Realestate","comments_summary":"Client experienced errors with Microsoft Dynamics 365 Business Central integration. Ashaff requested manual entry of specific records to identify the issue. Client reported an error message when posting the journal. Ashaff inquired about cost center requirement, which was confirmed. Concluded that the current integration doesn't support cost centers, and the client will proceed without integration."},{"key":"TSSD-3187","summary":"Accounting Integration - MS Business Central error","description":"after approving and authenticating the extension installation from Codat on microsoft BC environment. the screen closes and error pop up on Bayzat (unknown error)","project":"Technical Support Service Desk","assignee":"Ashaff Hussain","reporter":"Khalid Ibrahim","status":"Done","issuetype":"Bug","companyName":"Al-Bawani Company for Business Services","comments_summary":"Issue with Microsoft Dynamics 365 Business Central integration. Ashaff provided a document with instructions to resolve the problem. Khalid confirmed the issue was resolved by following Codat support article. The ticket was closed as the integration was successfully implemented."},{"key":"TSSD-3164","summary":"the client didn't receive the PMS number","description":"while the Mudad integration the client didn't receive the PMS number, what I need is to confirm with me the number that he should receive the OTP on it.","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nada Mohamed Sherif Mohamed Ragaey Kirah","status":"Done","issuetype":"New Feature","companyName":"Safqah Financial a one-person company","comments_summary":"Client unable to receive OTP for account verification. Engy confirmed OTP should be received on a number ending with 0000. Nada provided client's ID number and IBAN for verification. After multiple attempts to resolve the issue, Nada confirmed the ticket could be closed without further action needed."},{"key":"TSSD-3150","summary":"issu with accounting integration (microsof 365 diynamics)","description":"client can't integrate their accounting system with bayzat  they are using microsoft 356 dynamics they get an error message saying (Error try again later) and got the following message on console (will attach an image)","project":"Technical Support Service Desk","assignee":"Ashaff Hussain","reporter":"MOHAMED EKSHAIKH","status":"Done","issuetype":"Bug","companyName":"Alidara Real Estate","comments_summary":"Client experienced errors with accounting integration. Ashaff requested client's Dynamics 360 credentials for testing. Unable to share credentials, a meeting was suggested. After client review and some actions, Mohamed confirmed the issue was resolved and the ticket could be closed."},{"key":"TSSD-3148","summary":"Authorized Signatory Couldn't Submit Mudad Transaction","description":"An authorized signatory that is already added to Mudad integration connection details was not having access to the action button \"Process with Mudad\" Can you please check?","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Ali Ismael","status":"Done","issuetype":"Bug","companyName":"SIRIUS Trading Company","comments_summary":"Issue with adding authorized signatory. Initial claim of completion disputed. Engy identified bugs and applied fixes. Client instructed to follow specific steps to authorize Ghada AlDaajani. Attempt to add bank account resulted in error, suggesting client needs to check with the bank. Pending resolution with possible need for Mudad involvement."},{"key":"TSSD-2993","summary":"unable to sync with Xero","description":"Please check the attached error.","project":"Technical Support Service Desk","assignee":"Ashaff Hussain","reporter":"Magd Al Sayed Wahbe","status":"Done","issuetype":"Bug","companyName":"CC Energy DMCC","comments_summary":"Issue with Codat account for accounting integrations. Account was deactivated by Codat. Engy reported working on reactivation. Ashaff confirmed access restored and requested retry of sync attempt. Awaiting confirmation of successful sync."},{"key":"TSSD-2990","summary":"Bayzat and Netsuite Synchronization Issue","description":"The client was syncing Bayzat with Netsuite, and by error, the session was closed. When they attempted to sync again, the following error message appeared: Accounting confirmation already exists for given synchronization id: 044b95bb-1fdd-450d-befa-d549f59a089a","project":"Technical Support Service Desk","assignee":"Ashaff Hussain","reporter":"Tamara Al Tayyan","status":"Done","issuetype":"Bug","companyName":"Bidfood","comments_summary":"Client reported issue syncing payroll data with NetSuite. Initial sync attempt failed after an hour. Error message indicated transaction already in system. Issue escalated to engineering team. Ashaff confirmed the problem was fixed and data successfully pushed to NetSuite."},{"key":"TSSD-2926","summary":"couldn't integrate with Mudad","description":"an error accrued when trying integrating with Mudad in the first step","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nada Mohamed Sherif Mohamed Ragaey Kirah","status":"Done","issuetype":"Bug","companyName":"Skills Center","comments_summary":"Client faced error during Mudad integration. Engy identified incorrect number usage and provided correct details. Issue resolved, allowing progress to step 2 of integration. Client confirmed resolution."},{"key":"TSSD-2889","summary":"Xero Integration","description":"After pushing the records to Xero, the data is not going through. The sync status is still 'Pushing', for over 15hrs now","project":"Technical Support Service Desk","assignee":"Ashaff Hussain","reporter":"Daria Maksimova","status":"Done","issuetype":"Bug","companyName":"Daria Demo Account##DEMO","comments_summary":"Issue raised with engineering team. Engy later reported the problem should be solved and requested client to verify. Awaiting client feedback on resolution."},{"key":"TSSD-2873","summary":"Change Signatory Employee","description":"In Mudad connection the signatory's legal ID is related to an employee while the employee assigned is another employee we would like to assign the correct employee. \n\nThe current employee is Ghada (ghada@sirius.com.sa) and we would like to change it to Zahra (zahra@sirius.com.sa), please refer to this video for clarification:\nhttps://drive.google.com/file/d/1Ly1vsqrgmQZoZtvOtb9jM1QM5s9SEaZO/view?usp=sharing","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Ali Ismael","status":"Done","issuetype":"New Feature","companyName":"SIRIUS Trading Company","comments_summary":"Request received and assigned to Ashaff Hussain. Engy Attia confirmed the request was completed and asked for feedback from the customer."},{"key":"TSSD-2814","summary":"Error Message when we integrate with Mudad","description":"an error message pop-up","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nada Mohamed Sherif Mohamed Ragaey Kirah","status":"Done","issuetype":"Bug","companyName":"Palma for Travel and Tourism Company","comments_summary":"Request assigned to Ashaff Hussain. Customer provided a screenshot. Engy Attia identified an error from Mudad due to an expired commercial registration. Customer needs to update this document. Engy asked if the ticket could be closed or if further assistance was needed."},{"key":"TSSD-2802","summary":"Accounting integration, when mapping data on step 2 the next button is greyed out even though components have been mapped","description":"Accounting integration, when mapping data on step 2 the next button is greyed out even though components have been mapped","project":"Technical Support Service Desk","assignee":"Ashaff Hussain","reporter":"Rani El Eid","status":"Done","issuetype":"Bug","companyName":"Zeoof","comments_summary":"Request assigned to Ashaff Hussain. Engy Attia asked Ashaff to check the issue. Ashaff confirmed he would troubleshoot. He then explained that the customer needs to map all cost centers to proceed with configuration, either matching all departments with ledgers or using a custom list field instead."},{"key":"TSSD-2749","summary":"The transaction shows under process since 7th of September and the employees still didn't received their salaries","description":"The transaction shows under process since 7th of September and the employees still didn't received their salaries","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Sara Ali Abdelaziz","status":"Done","issuetype":"Bug","companyName":"Majal Al-Prevention Contracting Company for Radiation Health Consultations, a one-person company","comments_summary":"Request assigned to Ashaff Hussain. Sara Ali asked about adding multiple signatories. Ashaff initially treated it as a feature request. Sara clarified the need for multiple super admin signatories. Ashaff sought clarification, and Sara confirmed the requirement for multiple super admin signatories when there are multiple super admins."},{"key":"TSSD-2733","summary":"We need to add access to the super admin to process salaries   with Mudad through Bayzat","description":"We need to add access to the super admin to process salaries \n with Mudad through Bayzat\nzahra@sirius.com.sa","project":"Technical Support Service Desk","assignee":"Ashaff Hussain","reporter":"Sara Ali Abdelaziz","status":"In Progress","issuetype":"New Feature","companyName":"SIRIUS Trading Company","comments_summary":"Request assigned to Ashaff Hussain. Sara Ali inquired about adding multiple signatories. Ashaff initially treated it as a feature request. Sara clarified the need for multiple super admin signatories. After some time, Ashaff sought further clarification, and Sara confirmed the requirement for multiple super admin signatories when there are multiple super admins."},{"key":"TSSD-2709","summary":"Delayed Transaction Despite Sufficient Funds - Mudad","description":"The company informed me that they submitted this transaction over 10 days ago, yet the employees still haven't received it. Despite having sufficient funds in their account, the transaction status remains \"in process\" on Bayzat.","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Ali Ismael","status":"Done","issuetype":"Bug","companyName":"Majal Al-Prevention Contracting Company for Radiation Health Consultations, a one-person company","comments_summary":"Customer was blocked from processing payroll. Engy Attia checked Mudad response, which showed status code 102 (pending) for some transactions. One transaction was completed, while two others were initiated. Engy suggested contacting Mudad for further assistance."},{"key":"TSSD-2565","summary":"Mudad Integration error","description":"No establishment can be found with the provided establishment unified id.","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nada Mohamed Sherif Mohamed Ragaey Kirah","status":"Done","issuetype":"Bug","companyName":"Professional Buyer Investment Company","comments_summary":"Issue with adding a bank account. Error message indicated wrong MOL establishment ID format. Nada Mohamed resolved the issue by correcting the ID format from 10-xxxx to 01-xx. Ali Ismael provided support. Nada suggested requesting Saudization or Civilization certificate from Qwa for future reference."},{"key":"TSSD-2552","summary":"Request to Update Error Message Reference","description":"When an issue arises with an employee's data submission when processing payroll through Mudad, the error message currently refers to the employee using the backend ID \"97909ad1-37b1-4ab6-b10b-2602f9ae941e.\" Since this ID is not recognizable to our clients, could we update the error message to reference the employee's email address instead?","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Ali Ismael","status":"Done","issuetype":"New Feature","companyName":"Majal Al-Prevention Contracting Company for Radiation Health Consultations, a one-person company","comments_summary":"Ticket raised about unclear error messages when adding bank accounts. Engy Attia added the request to modify error messages to the backlog. Mustafa Khan agreed to discuss with the team. Later, Engy confirmed that error messages were modified and asked for feedback on similar cases."},{"key":"TSSD-2533","summary":"Adding Bank to Mudad Integration Failed","description":"The client used to have a company bank added to Mudad integration \"Al Inma\" the client deleted this bank from the company bank accounts and added another bank details \"Alrajhi\" when they are trying to add the new bank account to Mudad integration details nothing happen with no error message, or when try to delete the old one they get this error: Company bank details with id: d7431c41-2134-4d41-a6b8-d826283dc24d could not be found!\n\nCan you please help?","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Ali Ismael","status":"Done","issuetype":"Bug","companyName":"SIRIUS Trading Company","comments_summary":"Issue adding Alrajhi bank account. Engy Attia found two different requests with different signatory IDs, both receiving error responses from Mudad. One indicated an expired authorizer ID, the other showed the signatory not linked to the IBAN. Engy suggested the user check with their bank. The team decided to improve error message display."},{"key":"TSSD-2441","summary":"Can't integrate MS Dynamics successfully","description":"The platform gives us a message that integration is in progress and that we are fetching data for over than 3 hours now and no updates there","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Sara Ali Abdelaziz","status":"Done","issuetype":"Bug","companyName":"Taif Al-Shabakat Contracting Company","comments_summary":"Sara Ali reported an issue connecting MS Dynamics account. Engy Attia and Mustafa Khan investigated. Initially, there was confusion with another request. After team review and investigation, Engy confirmed that the MS Dynamics account was successfully connected, resolving the issue."},{"key":"TSSD-2392","summary":"Data Fail to sync \" Business Central\"","description":"journal entries are not syncing while cheque are working fine","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Yasser Raouf","status":"Done","issuetype":"Bug","companyName":"Rare","comments_summary":"Issue with Microsoft Dynamics integration. Codat team confirmed bank accounts can't be directly posted to; suggested creating a separate ledger account. Client asked to check with MS Dynamics support. Awaiting further input from the client. Ticket remains open pending resolution."},{"key":"TSSD-2196","summary":"Mudad Issue","description":"Mudad has reported a violation against the company for not paying an employee's salary. The company needs to justify this, as the employee was paid through Bayzat and the salary was successfully received. To obtain Mudad's approval of our justification, we need to send them an email with the details of the employee's salary transaction.","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Ali Ismael","status":"Done","issuetype":"New Feature","companyName":"Oasis Women's Resource Center","comments_summary":"Email sent to Mudad regarding company justification, urgent due to deadline. Engy confirmed email sent with all necessary information. Ali acknowledged receipt. Issue resolved and ticket likely closed."},{"key":"TSSD-2160","summary":"Transaction Status appears as in process although the salaries transferred successfully","description":"Transaction Status appears as in process although the salaries transferred successfully","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Sara Ali Abdelaziz","status":"Done","issuetype":"Bug","companyName":"Mathevon Middle East Industrial Company","comments_summary":"Investigated issue with Mudad transaction status. Response showed status code 102 (pending) for the main transaction, but all sub-transactions were completed (202). Engy suggested checking with Mudad team for clarification. No further updates; ticket status unclear."},{"key":"TSSD-2139","summary":"Accounting Integration Error-Report setup","description":"the client couldn't setup a report after accounting integration","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nada Mohamed Sherif Mohamed Ragaey Kirah","status":"Done","issuetype":"Bug","companyName":"FTG Development Co., Ltd. (one person)","comments_summary":"Issue with report setup action in accounting integration. Dev team confirmed it's restricted due to disabled payroll templates. Engy deployed an improvement to hide the Report Setup Button when Payroll Templates are disabled. Issue resolved and ticket closed."},{"key":"TSSD-2084","summary":"the client couldn't proceed with Mudad for 9 months till now","description":"there is an error message \"One or more beneficiary has invalid name\" I raised the same case last months and the issue was that the names weren't in capital and not as the Mudad English names \n\nnow all is in English and capitalized and still the same\n\nplease it is super urgent the client suffering for almost 9 months 7 of them due to we couldn't integrate with Mudad and 2 Months for the same issue","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nada Mohamed Sherif Mohamed Ragaey Kirah","status":"Done","issuetype":"Bug","companyName":"Oasis Women's Resource Center","comments_summary":"Problem with employee names format in Mudad integration. Engy advised changing names to proper English capitalization (e.g., 'Muath Almuzaini' instead of 'JAMBY SITCHON'). Later confirmed the issue was resolved and the ticket was closed."},{"key":"TSSD-1992","summary":"Accounting Integration with Microsoft","description":"the client want to integrate with Microsoft accounting system and looking for a meeting on upcoming Thursday 6 of June  at 10 AM KSA time","project":"Technical Support Service Desk","assignee":"Mustafa Khan","reporter":"Nada Mohamed Sherif Mohamed Ragaey Kirah","status":"Done","issuetype":"New Feature","companyName":"FTG Development","comments_summary":"Request received and assigned to Mustafa Khan. Nada Mohamed asked for availability confirmation. Engy Attia requested a check. Engy asked if the ticket could be closed, to which Nada Mohamed agreed. The issue was resolved and the ticket was closed."},{"key":"TSSD-1988","summary":"Big account using accounting integration, visual bug showing 0 amount processed, however 2 transactions have been made for 2 million Dirhams. Issue comes when doing the accounting integration with oracle, posts are showed as unpaid due to this bug. pleas…","description":"PLease check summary.","project":"Technical Support Service Desk","assignee":"Mustafa Khan","reporter":"Rani El Eid","status":"Done","issuetype":"Bug","companyName":"HORECA TRADE LLC","comments_summary":"Request received and assigned to Mustafa Khan. No further comments or actions were recorded, suggesting the issue was likely resolved quickly or required no additional intervention."},{"key":"TSSD-1854","summary":"The client receives an error message while trying to process the transaction through Mudad","description":"The client receives an error message while trying to process the transaction through Mudad","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Sara Ali Abdelaziz","status":"Done","issuetype":"Bug","companyName":"Mathevon Middle East Industrial Company","comments_summary":"Request received and assigned to Mustafa Khan. Sara Ali shared an image. Engy Attia reported an error message when trying from their side. Sara mentioned the client tried with the owner account without success. Engy requested the owner account details for testing. The issue was escalated to Mudad via email. The ticket remains open pending Mudad's response."},{"key":"TSSD-1796","summary":"Client couldn't integrate his platform with Mudad","description":"Every time the client doing the integration steps, she didn't receive the OTP code in step number 3","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Sara Ali Abdelaziz","status":"In Progress","issuetype":"Bug","companyName":"Saudi Vax","comments_summary":"Khalid Ibrahim shared a screenshot. Request assigned to Benjamin Nam. Mustafa Khan suggested closing the ticket as the customer had added an establishment. Khalid inquired about the source of the issue, noting a lack of error codes. The ticket was resolved with the customer successfully adding an establishment."},{"key":"TSSD-1763","summary":"Mudad Integration - Establishment can't be found","description":"when integrating with Mudad entering the correct establishment id on CR and MOL ID we get this error message\n\"No establishment can be found with the provided establishment unified id.\"","project":"Technical Support Service Desk","assignee":"Benjamin Nam","reporter":"Khalid Ibrahim","status":"Done","issuetype":"Bug","companyName":"Rent Car 79","comments_summary":"Khalid Ibrahim shared a screenshot. Request assigned to Benjamin Nam. Mustafa Khan suggested closing the ticket as the customer had added an establishment. Khalid inquired about the issue's source, noting no error codes. The ticket was resolved with the customer successfully adding an establishment."},{"key":"TSSD-1637","summary":"MPN not being generated","description":"The client has lulu integration, they select wire transfer and the MPN is not getting generated. Pls find a video attached","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Daria Maksimova","status":"Done","issuetype":"Bug","companyName":"Mojay Global Holding Limited","comments_summary":"Issue with MPN generation for Lulu. Initial attempts to resolve failed. Engy contacted Lulu team, who agreed to manually submit SIF file and generate MPN. Later confirmed Mojay successfully generated MPN. Issue resolved and ticket closed."},{"key":"TSSD-1632","summary":"Sync with Xero failed","description":"I am not able to understand the error message. Can you check it, please?","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Magd Al Sayed Wahbe","status":"Done","issuetype":"Bug","companyName":"Shredex","comments_summary":"Client encountered Xero integration issue. Advised to create separate Wages Payable account in Xero instead of using system account. Mustafa provided examples and instructions. Resolution pending client implementation and feedback."},{"key":"TSSD-1615","summary":"Late Mudad Transaction","description":"The client said they have processed salary through Mudad from Bayzat platform on 31 of March 2024 and it should have reflected in the employees' bank account by 2nd of April 2024, until now nothing reflected. Can we check the progress of this please.","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Ali Ismael","status":"Done","issuetype":"Bug","companyName":"The Reliable Women's Decoration Company","comments_summary":"Urgent salary payment issue reported. Initially suspected system error, but later discovered insufficient funds in client's bank account. Ticket closed due to client-side funding issue."},{"key":"TSSD-1595","summary":"mudad integration isseu","description":"client cannot process payroll through mudad integration","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"MOHAMED EKSHAIKH","status":"Done","issuetype":"Bug","companyName":"The Reliable Women's Decoration Company","comments_summary":"Client reported persistent error despite following instructions. Team investigated and escalated to development team. Awaiting resolution. Ticket status unclear, may require follow-up."},{"key":"TSSD-1591","summary":"Xero integration: missing cost centers","description":"We synced the data and it went through to Xero, but some cost centers are missing, could you please explain why this is happening and how we could rectify it? I'm attaching the sync report","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Daria Maksimova","status":"Done","issuetype":"Bug","companyName":"Crowd One","comments_summary":"Xero sync issue reported. Team escalated to development for investigation. Client confirmed issue resolution, and ticket was closed."},{"key":"TSSD-1580","summary":"Mudad Issue","description":"The client trying to process with Mudad for the first time and he gets this error: \"One or more beneficiary has invalid name.\" can you let us know who are the employees which have invalid name and how can we fix it?\n\nTransaction ID: \nf876c057-0498-40a3-ab17-6a15be1ec69a","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Ali Ismael","status":"Done","issuetype":"Bug","companyName":"Rohamaa International Trading Limited Company","comments_summary":"Client requested salary transfer. Issue with Mudad transaction due to Arabic account holder names. Engy Attia contacted Mudad for assistance. Mustafa Khan advised reviewing and correcting employee names to English, properly capitalized. Ali Ismael confirmed the transaction was processed after reviewing capital letters. Ticket resolved and closed."},{"key":"TSSD-1533","summary":"The process through Mudad button doesn't appear on the transaction page although the integration with Mudad was successfully done","description":"The process through Mudad button doesn't appear on the transaction page although the integration with Mudad was successfully done","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Sara Ali Abdelaziz","status":"Done","issuetype":"Bug","companyName":"Taif Al-Shabakat Contracting Company","comments_summary":"User unable to process transactions with Mudad. Engy Attia investigated and found only one employee (khaled@fastnet.com.sa) added as Mudad signatory. Instructions provided to add taif@fastnet.com.sa as an authorized signatory. Sara Ali acknowledged the solution. Issue resolved."},{"key":"TSSD-1532","summary":"The client Recieved an error while trying process the salary through Mudad","description":"The client Received an error while trying to process the salary through Mudad","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Sara Ali Abdelaziz","status":"Done","issuetype":"Bug","companyName":"Mona Hamed Muthib Al-Sulami and its partners company For Law and Legal Consultations","comments_summary":"Error processing Mudad transaction due to Arabic account holder names. Engy Attia advised changing employee bank account names to English. Sara Ali agreed to make changes. Suggestion made to add warning message for Arabic names before submission. Issue resolved pending client action."},{"key":"TSSD-1505","summary":"Mudad Integration Issue","description":"issue with one of the accounts (Enayaa Gheer Center) that wants to integrate with Mudad. I entered the details, but it's giving me the following error: no establishment can be found with the provided establishment unified ID. I double-checked all the details, and the establishment ID is correct.","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Haytham Ghali","status":"Done","issuetype":"Bug","companyName":"Enayaa Gheer Center","comments_summary":"Client reported error with Mudad integration. Engy Attia contacted Mudad team for assistance. Mudad suggested checking establishment ID. Haytham Ghali confirmed with the client. Issue resolved and ticket closed."},{"key":"TSSD-1443","summary":"Accounting Integration with 2 organization on Xero","description":"The client has 2 branches: Dubai and Abu Dhabi. On Bayzat, both branches are on the same account however, on Xero, they created 2 Organisation. Anyway to integrate this? or they have to combine both branches on Xero as well?","project":"Technical Support Service Desk","assignee":"Mustafa Khan","reporter":"Magd Al Sayed Wahbe","status":"Done","issuetype":"Support","companyName":null,"comments_summary":"Ticket opened for unspecified issue. Mustafa Khan assigned to handle. After follow-up from Magd Al Sayed Wahbe, Mustafa Khan investigated. No further details provided. Magd Al Sayed Wahbe later requested to close the ticket, indicating the issue was resolved or no longer relevant."},{"key":"TSSD-1420","summary":"Mudad Integration Issue","description":"Whenever the client tries to integrate with Mudad he gets an error that the establishment ID is not found, we have tried to update the trade license title and we tried all different company ID and still not working.","project":"Technical Support Service Desk","assignee":"Mustafa Khan","reporter":"Ali Ismael","status":"Done","issuetype":"Bug","companyName":"Tala Villas General Contracting Establishment","comments_summary":"User requested integration reset. Support escalated to development team. Mudad team claimed company doesn't exist despite documents provided. Issue remains unresolved with Mudad team unable to verify company's existence. Support suggested closing ticket due to lack of progress."},{"key":"TSSD-1416","summary":"Unable to close payroll","description":"unable to sync Feb 2024 payroll from Bayzat to Quickbooks, meaning we are unable to close our Feb books.","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Manisha Chincholia","status":"Done","issuetype":"Bug","companyName":"Baraka financial","comments_summary":"User reported issue with invoice numbers. Support escalated to development team. Fix deployed and confirmed working. Ticket resolved successfully."},{"key":"TSSD-1395","summary":"Unknown Credit entry","description":"a Client is asking what is the Credit entry of AED 8,500/- going to Salaries & Wages?","project":"Technical Support Service Desk","assignee":"Mustafa Khan","reporter":"Magd Al Sayed Wahbe","status":"Done","issuetype":"Support","companyName":"MUSTAFA KOITA FOOD & BEVERAGES TRADING L.L.C","comments_summary":"User inquired about unknown credit amount. Support escalated to development team. Confirmed client synced records to Xero, suggesting issue might be resolved. Awaiting final confirmation from Mustafa Khan."},{"key":"TSSD-1366","summary":"The client Can't choose the commercial registration no. while integrating with Mudad","description":"The client Can't choose the commercial registration no. while integrating with Mudad","project":"Technical Support Service Desk","assignee":"Mustafa Khan","reporter":"Sara Ali Abdelaziz","status":"Done","issuetype":"Bug","companyName":"Mona Hamed Muthib Al-Sulami and its partners company For Law and Legal Consultations","comments_summary":"User reported issue selecting commercial registration number. Support suggested renaming with English numbers. No further updates provided, issue status unclear."},{"key":"TSSD-1292","summary":"Mudad-PMS OTP-unreceivbable","description":"the customer couldn't receive the OTP in the last stage\nand this issue from more than 1 month and still the customer couldn't receive any codes\n\nthis is the phone number that the client should recieve their codes on it +966560040065","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nada Mohamed Sherif Mohamed Ragaey Kirah","status":"Done","issuetype":"Bug","companyName":"The United Designers Contracting Company","comments_summary":"User unable to receive integration code. Support escalated to development team. Issue resolved after restarting integration process from scratch. Integration completed successfully."},{"key":"TSSD-1228","summary":"Wrong month in Xero sync","description":"Jan payroll was closed, but the Pre-sync report for Jan 2024 shows Feb in the Journal entry name. Please find the pre-sync report attached.","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Daria Maksimova","status":"Done","issuetype":"Bug","companyName":"Crowd One Network Services LLC","comments_summary":"Request received and assigned to Mustafa Khan. Daria provided an attachment and followed up. Engy escalated to development team. Issue pending client action to setup accounting configuration again to delete problematic records. Ticket to be closed pending further updates."},{"key":"TSSD-1218","summary":"Accounting Integrations Issue - Cobbler","description":"The client uses Xero as their accounting software and is having an issue mapping the bank accounts under the select relevant account where specifically only bank categories are not showing up. I have attached screenshots for the same.","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nathan Philip Saldanha","status":"Done","issuetype":"Bug","companyName":"The Cobbler LTD","comments_summary":"Issue with Xero integration. Nathan reported problem with 'Next' button. Escalated to development team. Mustafa identified restrictions from Xero preventing accounts from showing in Bayzat. Client asked to check with Xero. Placeholder accounts need to be created by client in Xero. Issue remains unresolved, awaiting client action."},{"key":"TSSD-1162","summary":"Mapping in Xero integration can'be finalized","description":"Mapping in Xero integration can'be finalized although all items are picked","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Daria Maksimova","status":"Done","issuetype":"Bug","companyName":"Crowd One Network Services LLC","comments_summary":"Client reported issue with 'Next' button greyed out despite all items mapped. Ticket escalated to development team. Issue resolved within 2 days. Client confirmed the fix was successful."},{"key":"TSSD-1155","summary":"Sync with Xero failed","description":"Sync with Xero failed and unclear error message. Pls see attached.","project":"Technical Support Service Desk","assignee":"Mustafa Khan","reporter":"Magd Al Sayed Wahbe","status":"Done","issuetype":"Bug","companyName":"MUSTAFA KOITA FOOD & BEVERAGES TRADING L.L.C","comments_summary":"Client reported issue with account syncing. Escalated to development team and Codat. Codat identified the problem as an archived account in Xero. Client advised to update the account status to 'Active' in Xero and retry syncing. Issue resolved after client action."},{"key":"TSSD-1149","summary":"Sync error with Quickbooks","description":"Unable to sync payroll with Quickbooks it gives error \"Something went wrong\"","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Manisha Chincholia","status":"Done","issuetype":"Bug","companyName":"Baraka financial limited","comments_summary":"Client reported an unspecified issue. Ticket escalated to development team. Engy confirmed team was working on a fix. Client later confirmed the issue was resolved and requested the ticket to be closed."},{"key":"TSSD-1138","summary":"Let me know shared IBAN belongs to which employee profile on Bayzat","description":"Looking into a matter: The client asserts that the refund amount for an employee has been credited to the wrong IBAN. The IBAN number was communicated to the Lulu team via email through us, and according to Lulu, the amount has been credited to the specified IBAN: AE360260001015833235201.\n\nCould you assist us in identifying the account/employee associated with this IBAN on the Bayzat platform? Your prompt attention to this matter is highly appreciated. If you want more clarity then we can get on call. Thanks!","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Sneha Satish Chavan","status":"Done","issuetype":"New Feature","companyName":"Pan Gulf International Metals Industry LLC","comments_summary":"Request received for investigating wrong IBAN usage. Escalated to development team. After checking, it was found not to refer to anyone at Bayzat. Request made for SIF file containing the IBAN. No SIF file provided, so the ticket was closed."},{"key":"TSSD-1086","summary":"mudad-Error-Cannot get access token from Mudad.","description":"the customer couldn't process with mudad as there is an error message happened \"Cannot get access token from Mudad\"","project":"Technical Support Service Desk","assignee":"Mustafa Khan","reporter":"Nada Mohamed Sherif Mohamed Ragaey Kirah","status":"Done","issuetype":"Bug","companyName":"Air Care HVAC and Refrigeration Company","comments_summary":"Issue with Xero syncing reported, affecting contract renewal. Development team deployed a fix to production. Fix confirmed working, resolving the syncing problem."},{"key":"TSSD-1050","summary":"Unable to proceed on Accounting Integration","description":"The client has mapped the data required for the integration however the Next button is greyed out and they are unable to proceed with the submission.","project":"Technical Support Service Desk","assignee":"Benjamin Nam","reporter":"Nathan Philip Saldanha","status":"Done","issuetype":"Bug","companyName":"The Cobbler LTD","comments_summary":"Client faced Xero syncing issue for 5 months, putting contract renewal on hold. Fix deployed to production and confirmed working, resolving the syncing problem and addressing the client's concerns."},{"key":"TSSD-1019","summary":"Syncing with Xero is not working","description":"\"Something went wrong\" when try to sync with Xero. pls see attached.","project":"Technical Support Service Desk","assignee":"Benjamin Nam","reporter":"Magd Al Sayed Wahbe","status":"Done","issuetype":"Bug","companyName":"CC Energy DMCC","comments_summary":"Issue reported with Xero syncing over 5 months, affecting contract renewal. Problem escalated to development team. Fix deployed to production and confirmed working, resolving the syncing issue."},{"key":"TSSD-841","summary":"Do we have new accounting softwares integrated?","description":"I have seen that Codat added some new accounting software (example: Zoho) that they integrated with, are we also supporting this?\n\nhttps://www.codat.io/core-integrations/","project":"Technical Support Service Desk","assignee":"Mustafa Khan","reporter":"Ali Ismael","status":"Done","issuetype":"Support","companyName":null,"comments_summary":"Inquiry about Zoho Books integration. Not currently in roadmap due to insufficient customer interest. Watermelon Market mentioned as potentially interested. Confirmed no immediate plans for integrating with other accounting software due to lack of customer demand."},{"key":"TSSD-836","summary":"Mudad-PMS OTP-unreceivbable","description":"the customer couldn't receive the OTP in the last stage","project":"Technical Support Service Desk","assignee":"Benjamin Nam","reporter":"Nada Mohamed Sherif Mohamed Ragaey Kirah","status":"Done","issuetype":"Bug","companyName":"The United Designers Contracting Company","comments_summary":"Ticket opened regarding client's inability to receive OTP. Escalated to dev team. Engy advised client to retry multiple times. Nada confirmed client tried multiple times without success. Dev team to work on issue. Engy later stated OTP should reach client normally, suggested multiple retries. Issue remains unresolved, awaiting further action."},{"key":"TSSD-759","summary":"Mudad integration-Error message","description":"The customer possesses an STC Pay account and attempts to make transfers to Mudad through it. However, during the integration process, an error occurred stating that STC Pay is not among the supported banks by Mudad. This is contradictory to Mudad's new announcement, where they declared that STC Pay is one of their partners (image attached).","project":"Technical Support Service Desk","assignee":"Mustafa Khan","reporter":"Nada Mohamed Sherif Mohamed Ragaey Kirah","status":"Done","issuetype":"Bug","companyName":"Oasis Women's Resource Center","comments_summary":"Client experiencing issues with STC pay account. Mustafa Khan assigned to handle. Screenshots of error and account info provided. Engy escalated to dev team. Mustafa shared additional screenshot. No clear resolution mentioned, issue appears ongoing."},{"key":"TSSD-717","summary":"Mudad integration-Error message","description":"when the client try to integrate with Mudad there is an error message poped up with \"Something went wrong\"","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nada Mohamed Sherif Mohamed Ragaey Kirah","status":"Done","issuetype":"Bug","companyName":"The United Designers Contracting Company","comments_summary":"Issue with client's commercial registration number being incorrect. Dev team investigated and found Mudad error due to wrong CR number. Client provided correct CR number from official certificate. Engy confirmed issue resolved as client successfully passed 'add establishment' step."},{"key":"TSSD-715","summary":"Constant Accounting Integration issues","description":"The client has had constant accounting integration issues since they have onboarded and is requesting an urgent call to be setup to finalize and solve the hiccups. They accounting software they use is Microsoft Dynamics.\n\nConcern\n1. Unable to import the data.\n2. Cost centers continue to be an issue.","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nathan Philip Saldanha","status":"Done","issuetype":"Bug","companyName":"Maristo Hospitality","comments_summary":"Ticket opened, details unclear. Mustafa requested Aykut's review. Engy looped in Aykut and asked about creating a ticket in jungle board. No clear resolution or further details provided."},{"key":"TSSD-651","summary":"Salary Processing Error - Mudad","description":"Salary processing failed to due insufficient fund in the bank, while the client claim that the bank include an amount more than the amount to be processed. \n\nThe transaction that was failed was with the amount of 15,700 SAR","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Ali Ismael","status":"Done","issuetype":"Bug","companyName":"Majal Al-Prevention Contracting Company for Radiation Health Consultations, a one-person company","comments_summary":"Client experiencing issues with salary submission. Mustafa inquired about processing fees. Issue escalated to dev team. Later discovered client's bank account was frozen, requiring document completion to unfreeze. Client to retry salary submission after resolving bank issue."},{"key":"TSSD-640","summary":"Xero syn error when closing Dec payroll","description":"unable to close Dec month to proceed with account sync. attaching images for reference.","project":"Technical Support Service Desk","assignee":"Mustafa Khan","reporter":"Manisha Chincholia","status":"Done","issuetype":"Bug","companyName":"CC energy Dmcc","comments_summary":"Ticket opened for an unspecified issue. Mustafa Khan requested error details. Manisha Chincholia reported the issue was likely resolved due to a bug fix, but awaited client confirmation. Action paused pending further information."},{"key":"TSSD-570","summary":"Mudad Integration - OTP not received","description":"For the first step of Mudad integration the OTP is not received on the authorized person.\n\nKindly check and advise","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Khalid Ibrahim","status":"Done","issuetype":"Bug","companyName":"Jwatha","comments_summary":"Client reported sync issues with Maristo Hospitality and Sisis Eatery. For Maristo, changing journal didn't resolve. For Sisis, removing LOC dimension validation wasn't feasible. Issue escalated to development team. Workaround suggested: manual file upload option for accounting reports if available."},{"key":"TSSD-529","summary":"Accounting Integration Sync Failure - Maristo & Sisys","description":"The client has setup accounting integration with us and uses Microsoft Dynamics however upon syncing gets errors on both accounts\nMaristo - Screenshot attached to ticket\nSisys - Screenshot attached to ticket\nIn addition to the above they would like to understand in which environment are the successful syncs going","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nathan Philip Saldanha","status":"Done","issuetype":"Bug","companyName":"Maristo Hospitality & Sisys Eatery","comments_summary":"Client reported issues with payroll sync to accounting system. Initial troubleshooting focused on beneficiary names in 'paid via' section. Further investigation revealed potential problems with Iqama IDs and National IDs. Ali Ismael committed to fixing these ID issues."},{"key":"TSSD-484","summary":"Error with Mudad Processing","description":"Error while processing salary through Mudad: \n\"One or more beneficiary name is invalid\"","project":"Technical Support Service Desk","assignee":"Mustafa Khan","reporter":"Ali Ismael","status":"Done","issuetype":"Bug","companyName":"End Consumer Event PR Promotion & Production","comments_summary":"Issue with employee names in GOSI system. Mustafa Khan advised matching names exactly as per GOSI, not using all capitals. Problem persisted with Arabic names needing English translations. New error emerged related to Iqama and National IDs. Ali Ismael identified incorrect IDs and committed to fixing them."},{"key":"TSSD-470","summary":"Mudad Integration for Multi-Company Platform","description":"How can we manage the integration of Mudad if a platform include two companies with two CRs and they have two accounts in Mudad?","project":"Technical Support Service Desk","assignee":"Ammar Nadir","reporter":"Ali Ismael","status":"Done","issuetype":"Support","companyName":"Majal Al-Prevention Contracting Company for Radiation Health Consultations","comments_summary":"Client inquired about adding multiple CRs to their account. Ammar Nadir explained the process: after adding the first CR, an 'add new account' button appears in integration details. First CR is free, additional ones are paid. Client confirmed understanding of the process."},{"key":"TSSD-449","summary":"Difference in numbers","description":"There is a difference in numbers and client is not able to sync. Please see attached.","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Magd Al Sayed Wahbe","status":"Done","issuetype":"Bug","companyName":"CC Energy DMCC","comments_summary":"Issue reported with Xero sync. Support team escalated to development. Client asked for updates. On Dec 4, Engy confirmed the issue was fixed and synced successfully. Client acknowledged resolution."},{"key":"TSSD-429","summary":"Some questions about Accounting integrationn","description":"Client asked the following questions: \n1. When salaries are synced to Xero, will the entries go under expenses as account and also under payable as bill? \n2. Can we group Basic salary + fixed allowances + other allowances + Temporary fuel allowances as one entry to Xero?","project":"Technical Support Service Desk","assignee":"Ashaff Hussain","reporter":"Magd Al Sayed Wahbe","status":"Done","issuetype":"Support","companyName":"MUSTAFA KOITA FOOD & BEVERAGES TRADING L.L.C","comments_summary":"Client reported Xero sync issues. Ashaff identified missing paid via configuration, suggested workaround. Development team involvement needed. Client experienced multiple integration issues. Resolution pending scheduled call on Dec 21st."},{"key":"TSSD-382","summary":"Xero integration - Sync failed","description":"The sync failed for all employees, please find the sync report attached.\n\nSame client faced another issue before: [TSSD-135] Accounting system integration bug (Xero). This has been actioned as per the PM's guidance.","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Daria Maksimova","status":"Done","issuetype":"Bug","companyName":"RTA Careem","comments_summary":"Xero sync failed. Ashaff identified missing paid via configuration, suggested workaround. Development team involvement needed. Client had multiple integration issues. Meeting scheduled for Dec 21st to resolve ongoing problems."},{"key":"TSSD-366","summary":"Xero integration - Discrepancy in the total net pay","description":"The pre-sync report amount and the total payout in the payroll table are not matching:\nTotal net pay for November 2023: AED 694,832.40\nPre-sync report for November 2023: 695,146.75\nCould you please clarify why this might be happening?","project":"Technical Support Service Desk","assignee":"Mustafa Khan","reporter":"Daria Maksimova","status":"Done","issuetype":"Bug","companyName":"RTA Careem","comments_summary":"Discrepancy in synced amounts identified. Engy investigated and found the difference equals total deductions. Confirmed as expected behavior: deductions subtracted on payroll side, added as credit on accounting side. Issue resolved, client advised to proceed."},{"key":"TSSD-344","summary":"Quickbooks integration issue","description":"The client gets the following errors in the sync report: \n\n'Errors:AccountingConfirmationValidation(itemId=null, message=BadRequest - Business Validation Error: Unable to save, sum of split home amounts did not add up to zero., validatorName=null)'","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Daria Maksimova","status":"Done","issuetype":"Bug","companyName":"NIL Data Communication Middle East DMCC","comments_summary":"Sync issue reported. Daria provided sync report. Support team escalated to development team. Resolution pending, awaiting feedback from development team."},{"key":"TSSD-279","summary":"Accounting Integration Issues - Maristo Hospitality / Sisys","description":"The client has setup accounting integration with us and uses Microsoft Dynamics however upon syncing gets errors on both accounts\nMaristo - Screenshot attached to ticket\nSisys - Screenshot attached to ticket\nIn addition to the above they would like to understand in which environment are the successful syncs going","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nathan Philip Saldanha","status":"Done","issuetype":"Bug","companyName":"Maristo Hospitality","comments_summary":"Client reported issues with Maristo Hospitality and Sisis Eatery Restaurant LLC. For Maristo, retry sync with different journal suggested. For Sisis, Codat explained error due to required location dimension. Development team implemented a fix. Client confirmed posting but with incorrect wages amount. Issue partially resolved, manual correction required."},{"key":"TSSD-263","summary":"Xero Sync failing with error message","description":"The payroll was closed and while syncing it fails with an error message \"A validation exception occurred - Account code 1000 is not a valid code for this document.","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Nathan Philip Saldanha","status":"Done","issuetype":"Bug","companyName":"Unified International DWC LLC","comments_summary":"Client encountered error using account code 1000 for transaction. Engy explained this was a bank account, unsuitable for the transaction type. Suggested using a different account. Nathan confirmed he would inform the client. Issue resolved with clear explanation and workaround provided."},{"key":"TSSD-239","summary":"Accounting Integration - Sync Failing","description":"October's payroll is closed, whenever super admin tries to sync data, it fails. The same thing happened last month but when I tried again, it worked. This time, issue persists.","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Sherine Salem","status":"Done","issuetype":"Bug","companyName":"NIL Data Communication Middle East DMCC","comments_summary":"Client reported sync issues. Tech team investigated and implemented a fix. Client asked to retry. Engy confirmed sync was successful after fix. Issue resolved through collaborative effort between support and development teams."},{"key":"TSSD-187","summary":"Error while syncing to Xero","description":"The below error is received when client tried to sync Oct salaries to Xero. He also confirmed that no entries were posted on Xero","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Magd Al Sayed Wahbe","status":"Done","issuetype":"Bug","companyName":"CC Energy DMCC","comments_summary":"Client reported incorrect journal entry amounts. Support team investigated, found development pushed changes twice by mistake. Manual corrections made. Issue partially resolved, but required client to manually adjust discrepancies. Engy suggested this was a one-time error due to backend fixes."},{"key":"TSSD-135","summary":"Accounting system integration bug (Xero)","description":"Please help with resolving the Xero integration bug","project":"Technical Support Service Desk","assignee":"Engy Attia","reporter":"Daria Maksimova","status":"Done","issuetype":"Bug","companyName":"RTA Careem","comments_summary":"Client reported error message. Engy suggested changing the 'Paid via' selection to a non-bank account. Daria acknowledged and involved Rani for further investigation. Issue pending resolution, awaiting client feedback on suggested workaround."}]